network-tests/v2/oha-results/s3-bucket/baseline-service-mesh-poc-vm-warm-up-2-tests/test-vm-warm-up-2-bookinfo-basic-32.txt
Started at 2024-03-29-16-38
Summary:
  Success rate:	100.00%
  Total:	73.3702 secs
  Slowest:	0.4767 secs
  Fastest:	0.0975 secs
  Average:	0.2346 secs
  Requests/sec:	136.2950

  Total data:	47.31 MiB
  Size/request:	4.
  Size/sec:	660.24 KiB

Response time histogram:
  0.097 [1]    |
  0.135 [75]   |
  0.173 [595]  |■■■■■
  0.211 [2169] |■■■■■■■■■■■■■■■■■■
  0.249 [3714] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.287 [2442] |■■■■■■■■■■■■■■■■■■■■■
  0.325 [750]  |■■■■■■
  0.363 [211]  |■
  0.401 [35]   |
  0.439 [7]    |
  0.477 [1]    |

Response time distribution:
  10.00% in 0.1823 secs
  25.00% in 0.2070 secs
  50.00% in 0.2335 secs
  75.00% in 0.2603 secs
  90.00% in 0.2872 secs
  95.00% in 0.3058 secs
  99.00% in 0.3470 secs
  99.90% in 0.3984 secs
  99.99% in 0.4371 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.0070 secs, 0.0034 secs, 0.0633 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0028 secs

Status code distribution:
  [200] 10000 responses
Finished at 2024-03-29-16-39